app/Http/Controllers/Menu/MenuItemController.php

    public function index(Request $request)
    {
        //
        $menuItems = DB::table('menu_items')
            ->select('menu_items.*', 'menu_groups.name as menu_group_name')
            ->join('menu_groups', 'menu_items.menu_group_id', '=', 'menu_groups.id')
            ->when($request->input('name'), function ($query, $name) {
                return $query->where('menu_items.name', 'like', '%' . $name . '%');
            })
            ->when($request->input('url'), function ($query, $url) {
                return $query->where('url', 'like', '%' . $url . '%');
            })
            ->paginate(10);
---
select `menu_items`.*, `menu_groups`.`name` as `menu_group_name` from `menu_items` inner join `menu_groups` on `menu_items`.`menu_group_id` = `menu_groups`.`id` limit 10 offset 0
select count(*) as aggregate from `menu_items` inner join `menu_groups` on `menu_items`.`menu_group_id` = `menu_groups`.`id`