app/Http/Controllers/Menu/MenuGroupController.php

select * from `menu_groups` limit 10 offset 0
select count(*) as aggregate from `menu_groups`
---
    public function index(Request $request)
    {
        //
        $menuGroups = DB::table('menu_groups')
            ->when($request->input('name'), function ($query, $name) {
                return $query->where('name', 'like', '%' . $name . '%');
            })
            ->paginate(10);