routes/web.php

select * from `users`
---
    });
    Route::resource('user', UserController::class);
    Route::post('import', [UserController::class, 'import'])->name('user.import');
    Route::get('export', [UserController::class, 'export'])->name('user.export');