app/Http/Controllers/UserController.php

select `id`, `name`, `email`, DATE_FORMAT(created_at, '%d %M %Y') as created_at from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index(Request $request)
    {
        //index -> menampilkan tabel data
        // mengambil data
        $users = DB::table('users')
            ->when($request->input('name'), function ($query, $name) {
                return $query->where('name', 'like', '%' . $name . '%');
            })
            ->select('id', 'name', 'email', DB::raw("DATE_FORMAT(created_at, '%d %M %Y') as created_at"))
            ->paginate(10);