app/Http/Controllers/RoleAndPermission/RoleController.php

    public function index(Request $request)
    {
        $roles = DB::table('roles')
            ->when($request->input('name'), function ($query, $name) {
                return $query->where('name', 'like', '%' . $name . '%');
            })
            ->paginate(10);
---
select * from `roles` limit 10 offset 0
select count(*) as aggregate from `roles`